{"endpoint":"schedule","cached":"2016-05-12 05:01:44","data":[{"items":[{"ID":278,"title":"Data Science essentials in Azure ML","slug":"data-science-essentials-in-azure-ml","featured_image":false,"featured_image_srcset":false,"speaker":232,"description":"<p><span  >In this session i am covering data science principals such as: Regression, Clustering, Classification, Recommendation and how to build programmable components in Azure Machine Learning experiments using data science programming languages. The session shows and illustrate how to implement these concepts use Azure ML studio.<\/span><\/p>\n","room":"Virginia Room","summary":"In this session i am covering data science principals such as: Regression, Clustering, Classification, Recommendation and how to build programmable components in Azure Machine Learning experiments usi","starts":1461330000,"ends":1461332700,"starts_pretty":"9:00 am","ends_pretty":"9:45 am"},{"ID":287,"title":"A Brief History of Cryptography","slug":"a-brief-history-of-cryptography","featured_image":false,"featured_image_srcset":false,"speaker":251,"description":"<p><span  >Many have seen the great cryptography debate on the news lately. Many would be surprised to know that this is not the first time that the United States and other nations have believed cryptography is something that needs to be regulated. Here, we&#8217;ll talk about cryptography, it&#8217;s origins, and its impact on society, governments, and entertainment.<\/span><\/p>\n","room":"Chesapeake Room A & B","summary":"Many have seen the great cryptography debate on the news lately. Many would be surprised to know that this is not the first time that the United States and other nations have believed cryptography is","starts":1461330000,"ends":1461332700,"starts_pretty":"9:00 am","ends_pretty":"9:45 am"},{"ID":291,"title":"Happy Developers are Better Developers","slug":"happy-developers-are-good-developers","featured_image":false,"featured_image_srcset":false,"speaker":260,"description":"<p><span  >Happy developers write better code, create stronger teams, and don’t look for new jobs. Building teams of happy, productive developers starts with the hiring process. Retaining top talent is easy to do if it becomes a part of your management personality.<\/span><\/p>\n<p>Curating the right talent on your team is a learned skill, not an artform. Improving hiring techniques, meeting developer’s needs, and implementing retention strategies will pay dividends and make your teams perform at a higher level.<\/p>\n","room":"Lynnhaven Room","summary":"Happy developers write better code, create stronger teams, and don’t look for new jobs. Building teams of happy, productive developers starts with the hiring process. Retaining top talent is easy to d","starts":1461330000,"ends":1461332700,"starts_pretty":"9:00 am","ends_pretty":"9:45 am"},{"ID":229,"title":"Cross-Platform Web Apps with ASP.NET  Core 1.0","slug":"cross-platform-web-apps-with-asp-net-core-1-0","featured_image":false,"featured_image_srcset":false,"speaker":228,"description":"<p><span  >Developers, learn how you can build modern web applications using the all-new ASP.NET Core 1.0 on your platform of choice! From Web Apps to Web APIs, you can use Visual Studio 2015 on Windows or the all-new Visual Studio Code on Windows, Mac or Linux. Use your JavaScript skills to build a Single Page Application front-end to interact with a Web API back-end. <\/span><\/p>\n","room":"Chesapeake Room C","summary":"Developers, learn how you can build modern web applications using the all-new ASP.NET Core 1.0 on your platform of choice! From Web Apps to Web APIs, you can use Visual Studio 2015 on Windows or the a","starts":1461330000,"ends":1461332700,"starts_pretty":"9:00 am","ends_pretty":"9:45 am"}],"key":"0900-0945","starts_pretty":"9:00 am","ends_pretty":"9:45 am"},{"items":[{"ID":290,"title":"How to make IoT devices speak with fire","slug":"how-to-make-iot-devices-speak-with-fire","featured_image":false,"featured_image_srcset":false,"speaker":258,"description":"<p><span  >Have an interest in taking your software skills into the real world? Want to learn how to build IoT devices and with a toolkit that let’s you extend them with software easily? Then this session is for you. I will be walking you through implementing an IoT toolkit that I have been working with for the past year to create internet connected things that can sense, respond, control, and of course shoot fire and speak (https:\/\/www.hackster.io\/Dlbates\/iot-flaming-and-talking-pumpkin-using-aws-and-esp8266-49934f\/)! You can expect to walk away armed with the tools and processes necessary to jumpstart your own IoT development. I will walk through installing and configuring the ELK stack (Elasticsearch, Kibana, and Logstash) and how to use it with Microcontrollers like the ESP8266, Photon, RasPi, and more. Then we can talk about how to showcase and search the data to provide rich dashboards, interactive interfaces, and calculated values via ElasticSearch and Kibana. Finally I will touch on security and redundancy in your IoT applications using this approach. <\/span><\/p>\n","room":"Chesapeake Room C","summary":"Have an interest in taking your software skills into the real world? Want to learn how to build IoT devices and with a toolkit that let’s you extend them with software easily? Then this session is for","starts":1461333600,"ends":1461336300,"starts_pretty":"10:00 am","ends_pretty":"10:45 am"},{"ID":292,"title":"Career advice for a OSS focused Software Developer","slug":"career-advice-for-a-oss-focused-software-developer","featured_image":false,"featured_image_srcset":false,"speaker":262,"description":"<p><span  >Reflections and advice on how to properly build a career as an OSS contributor and advocate. Specifically, how to do you manage the risks of building a traditional career, what are your options, what are roles to go after and how do you move your career forward.<\/span><\/p>\n<p>I&#8217;ll be telling my own story of working in OSS for over 12 years, building several companies, selling one and then what I did for the next chapter.<\/p>\n<p>My goal will be to communicate how to build a life and career working in the land of Open Source software, even when you have bigger responsibilities like a family and mortgage. It is possible and it&#8217;s possible to thrive while doing so. I want to spread that message.<\/p>\n","room":"Chesapeake Room A & B","summary":"Reflections and advice on how to properly build a career as an OSS contributor and advocate. Specifically, how to do you manage the risks of building a traditional career, what are your options, what","starts":1461333600,"ends":1461336300,"starts_pretty":"10:00 am","ends_pretty":"10:45 am"},{"ID":342,"title":"Unifying Design and the Front-End with React and Atomic Components","slug":"unifying-design-and-the-front-end-with-react-and-atomic-components","featured_image":false,"featured_image_srcset":false,"speaker":343,"description":"<p>Designed by Brad Frost and Dave Olsen, atomic design is a wonderful “methodology for creating design systems” backed by Pattern Lab with five distinct levels or ‘building blocks’, which, when combined, create semantic, contextual relationships between interface objects. We’re going to explore how these organizing principles are a natural fit for building interfaces in React, and how with a few tweaks we can begin to contextualize entire interfaces semantically and intuitively.<\/p>\n","room":"Lynnhaven Room","summary":"Designed by Brad Frost and Dave Olsen, atomic design is a wonderful “methodology for creating design systems” backed by Pattern Lab with five distinct levels or ‘building blocks’, which, when combined","starts":1461333600,"ends":1461336300,"starts_pretty":"10:00 am","ends_pretty":"10:45 am"},{"ID":220,"title":"Cross-Platform Desktop Apps with Electron","slug":"cross-platform-desktop-apps-with-electron","featured_image":"\/media\/electron-editor-300x52.png","featured_image_srcset":"\/media\/electron-editor-300x52.png 300w, \/media\/electron-editor.png 847w","description":"<p><span  >Would you like to leverage your HTML, CSS, and JavaScript skills to build cross-platform desktop applications? Electron is an open source application shell created by GitHub, designed to make building great desktop applications easy. You may have already experienced Electron using applications such as Atom, Slack, or Visual Studio Code. In this talk, you will learn its features, how to quickly get started, and tips from my experience building Electron applications.<\/span><\/p>\n","speaker":218,"room":"Virginia Room","summary":"Would you like to leverage your HTML, CSS, and JavaScript skills to build cross-platform desktop applications? Electron is an open source application shell created by GitHub, designed to make building","starts":1461333600,"ends":1461336300,"starts_pretty":"10:00 am","ends_pretty":"10:45 am"}],"key":"1000-1045","starts_pretty":"10:00 am","ends_pretty":"10:45 am"},{"items":[{"ID":281,"title":"Predicting Privilege with Python: Do Millennials make the grade?","slug":"predicting-privilege-with-python-do-millennials-make-the-grade","featured_image":false,"featured_image_srcset":false,"speaker":237,"description":"<p><span  >Millennials: Overconfident, lazy and coddled &#8211; or are they? Does this stereotype resonate everywhere or only in traditional settings? What happens when we evaluate less traditional environments such as Massive Open Online Courses such as Coursera to see how well they adopt to this new way of learning that is fundamentally self-driven and self-motivated.<\/span><\/p>\n<p>We will address this question by employing data science and Machine Learning techniques using python to gain insights into the age of Millennials. The audience will learn how to analyze sentiment from interviews; how to do predictive analytics using data structures and data analysis tools provided by the pandas library for python; and how to visualize data using the matplotlib package.<\/p>\n<p>Through a case study employing sentiment analysis of interview transcripts, we gain a deeper understanding of motivations and barriers experienced by Millennial students participating in Massive Open Online Courses (MOOCs). We seek to understand why learners take courses, and identify factors both inside and outside of course settings that impact engagement and learning. Thirty-six participants in Coursera’s Introduction to Chemistry and Data Science and Statistical Inference courses were interviewed, and these students varied in age, experience with the subject matter, and worldwide geographical location. We will explore the effectiveness of this learning channel via sentiment analysis and data visualizations.<\/p>\n","room":"Virginia Room","summary":"Millennials: Overconfident, lazy and coddled &#8211; or are they? Does this stereotype resonate everywhere or only in traditional settings? What happens when we evaluate less traditional environments","starts":1461337200,"ends":1461339900,"starts_pretty":"11:00 am","ends_pretty":"11:45 am"},{"ID":282,"title":"Building Motion Detecting Web Apps with JavaScript","slug":"building-a-motion-activated-snapshot-feed","featured_image":false,"featured_image_srcset":false,"speaker":240,"description":"<p><span  >What do my pets do when no one is around? I decided to find out. My session will cover how (and then some).<\/span><\/p>\n<p>A webcam and some JavaScript using WebRTC is enough to take snapshots, but the trick is finding the snapshots worth saving. I&#8217;ll share how to write an image diffing algorithm that creates a visual motion heatmap, which can be used to programmatically recognize when a snapshot has caught something happening. The interesting snapshots are then uploaded to Twitter for remote viewing.<\/p>\n<p>Even modestly sized images can contain a lot of data in the form of pixels, so I&#8217;ll discuss how to lighten the computational load while keeping acceptable accuracy.<\/p>\n<p>I&#8217;ll also talk about making this work on affordable hardware (Raspberry Pi, cheap Android phones), other potential uses for diffing and motion sensing, and some interesting\/spooky issues I came across.<\/p>\n","room":"Chesapeake Room C","summary":"What do my pets do when no one is around? I decided to find out. My session will cover how (and then some). A webcam and some JavaScript using WebRTC is enough to take snapshots, but the trick is find","starts":1461337200,"ends":1461339900,"starts_pretty":"11:00 am","ends_pretty":"11:45 am"},{"ID":202,"title":"Breaking into Gaming with Unity","slug":"breaking-into-gaming-with-unity","featured_image":"\/media\/Official_unity_logo-300x109.png","featured_image_srcset":"\/media\/Official_unity_logo-300x109.png 300w, \/media\/Official_unity_logo.png 676w","description":"<p><span  >Unity is fast becoming the industry standard for game development. Many industry jobs are now seeking developers with Unity experience. However, many new developers have trouble learning Unity because it is so different than other tools they may have used before. People can be intimidated by Unity because they do not understand topics such as object oriented programming or 3D modeling.<\/span><\/p>\n<p>I can empower people to break down that barrier and learn game development with Unity.<\/p>\n<p>This talk would build a 3D game from the ground up. This talk will demonstrate concepts such as navigating the Unity editor, player input, collecting power ups, scoring, and win conditions. Depending on time constraints I will either deliver a lecture style presentation or encourage audience members to follow along and build the game with me. Either way, the source code will be publicly available with additional resources so the audience will be able to re-build the game themselves and continue development long after the talk is over.<\/p>\n","speaker":200,"room":"Chesapeake Room A & B","summary":"Unity is fast becoming the industry standard for game development. Many industry jobs are now seeking developers with Unity experience. However, many new developers have trouble learning Unity because","starts":1462978800,"ends":1462981500,"starts_pretty":"11:00 am","ends_pretty":"11:45 am"},{"ID":206,"title":"Angular 2: Poster Child for Continuous Improvement","slug":"a-brief-history-and-mis-history-of-modularity","featured_image":false,"featured_image_srcset":false,"description":"<p>We can rebuild it! We have the technology!<\/p>\n<p>In this chat, Travis will be talking about the fresh new look of Angular 2. The focus will be on providing a solid starting point for beginners looking to pick up Angular in it&#8217;s revised form while taking cues from the Hulk and Spider-Man franchises by (mostly) ignoring the original&#8217;s existence.<\/p>\n","speaker":405,"room":"Lynnhaven Room","summary":"We can rebuild it! We have the technology! In this chat, Travis will be talking about the fresh new look of Angular 2. The focus will be on providing a solid starting point for beginners looking to pi","starts":1462978800,"ends":1462981500,"starts_pretty":"11:00 am","ends_pretty":"11:45 am"}],"key":"1100-1145","starts_pretty":"11:00 am","ends_pretty":"11:45 am"},{"items":[{"title":"Lunch","location":"Sunset Room","starts":1462982400,"ends":1462985100,"starts_pretty":"12:00 pm","ends_pretty":"12:45 pm"}],"key":"1200-1245","starts_pretty":"12:00 pm","ends_pretty":"12:45 pm"},{"items":[{"ID":214,"title":"Get Hired Like A Boss","slug":"get-hired-like-a-boss","featured_image":false,"featured_image_srcset":false,"description":"<p><span  >Looking for a job–or a promotion–is both art and science. In this session you&#8217;ll hear from a person with deep experience hiring and developing technical talent, about things commonly standing between you and your next role. Whether you&#8217;re looking for your first job or trying to find more mid-\/late-career advancement, you&#8217;ll come away with practical advice on how to avoid professional pitfalls and advice on future-proofing your career. <\/span><\/p>\n","speaker":210,"room":"Sunset Room","summary":"Looking for a job–or a promotion–is both art and science. In this session you&#8217;ll hear from a person with deep experience hiring and developing technical talent, about things commonly standing be","starts":1461429900,"ends":1461431700,"starts_pretty":"12:45 pm","ends_pretty":"1:15 pm"}],"key":"1245-1315","starts_pretty":"12:45 pm","ends_pretty":"1:15 pm"},{"items":[{"ID":279,"title":"How to Build a Developer: 10 Lessons from Apprenticeship","slug":"how-to-build-a-developer-10-lessons-from-apprenticeship","featured_image":false,"featured_image_srcset":false,"speaker":234,"description":"<p><span  >There are lots of ways to become a developer: you can get a college degree, attend a 3-month &#8220;developer academy&#8221;, teach yourself&#8230; or become an apprentice. In 2014, our company decided to tackle the challenge of growing our team through software apprenticeship. Our program accepts candidates with little to no formal development experience, and provides them with intensive, paid training over a period of 3 months. Upon successful completion of the program, apprentices are hired as full-time developers. In 2 years we&#8217;ve learned and grown as a team, experienced tremendous successes and painful failures, and helped nearly 30 people build new careers for themselves. This talk will introduce the concept of software apprenticeship and share the lessons, challenges, and rewards of creating a successful apprenticeship program.<br \/>\n<\/span><\/p>\n","room":"Virginia Room","summary":"There are lots of ways to become a developer: you can get a college degree, attend a 3-month &#8220;developer academy&#8221;, teach yourself&#8230; or become an apprentice. In 2014, our company decide","starts":1461346200,"ends":1461348900,"starts_pretty":"1:30 pm","ends_pretty":"2:15 pm"},{"ID":289,"title":"A Swift Introduction to Swift","slug":"a-swift-introduction-to-swift","featured_image":false,"featured_image_srcset":false,"speaker":256,"description":"<p><span  >Swift is an exciting new language introduced by Apple during WWDC 2014. Taking cues from modern languages such as Rust and F#, Swift is a refreshing replacement for the aging Objective-C language. Apple has also open sourced Swift. This means it could soon power web servers on the open web. Swift&#8217;s playground environment makes it easy to quickly play with the language and is the tool of choice for experimentation. This session will bring you up to speed with the Swift language through live code demos inside of a Swift playground. You&#8217;ll leave with the knowledge needed to tackle iOS, Mac and eventually web applications using a new language.<\/span><\/p>\n","room":"Chesapeake Room C","summary":"Swift is an exciting new language introduced by Apple during WWDC 2014. Taking cues from modern languages such as Rust and F#, Swift is a refreshing replacement for the aging Objective-C language. App","starts":1461346200,"ends":1461348900,"starts_pretty":"1:30 pm","ends_pretty":"2:15 pm"},{"ID":293,"title":"Polymer & App-state: \"Polymer, Flux. Flux, Polymer.\"","slug":"polymer-app-state-polymer-flux-flux-polymer","featured_image":false,"featured_image_srcset":false,"speaker":264,"description":"<p><span  >The Flux pattern heralded by Facebook is well-known and highly-regarded in the world of React, but React&#8217;s browser-loving counterpart hasn&#8217;t quite caught-on. Polymer is a wonderful platform for building web components, and with just a little extra love it can excel in backing sizable applications as well. This session will introduce Flux, highlight the necessity of adopting a deliberate pattern for managing application state in your Polymer app, and cover one Funky path to success using Reflux.<\/span><\/p>\n","room":"Lynnhaven Room","summary":"The Flux pattern heralded by Facebook is well-known and highly-regarded in the world of React, but React&#8217;s browser-loving counterpart hasn&#8217;t quite caught-on. Polymer is a wonderful platfor","starts":1461346200,"ends":1461348900,"starts_pretty":"1:30 pm","ends_pretty":"2:15 pm"},{"ID":294,"title":"Building React-Native on Windows","slug":"building-react-native-on-windows","featured_image":false,"featured_image_srcset":false,"speaker":374,"description":"<p><span  >The dream of many has been to build native applications using the technologies such as HTML and JavaScript. React has been a hot technology as of late to build fast and responsive web applications using the virtual-dom, JSX and other technologies. This idea quickly spread to building apps for the desktop using React like technologies. Enter React-Native, which allows you to build amazing experiences using the technologies you already know with JavaScript and React. Currently, this is only available for iOS and Android. But what about the Windows Universal Platform, which allows us to build apps for the phone, desktop, Xbox and even Hololens? In this session, we’ll talk about how we built React-Native for Windows at Microsoft!<\/span><\/p>\n","room":"Chesapeake Room A & B","summary":"The dream of many has been to build native applications using the technologies such as HTML and JavaScript. React has been a hot technology as of late to build fast and responsive web applications usi","starts":1461346200,"ends":1461348900,"starts_pretty":"1:30 pm","ends_pretty":"2:15 pm"}],"key":"1330-1415","starts_pretty":"1:30 pm","ends_pretty":"2:15 pm"},{"items":[{"ID":296,"title":"Why did the robot cross the road? Computer vision, robots and mobile games.","slug":"why-did-the-robot-cross-the-road-computer-vision-robots-and-mobile-games","featured_image":false,"featured_image_srcset":false,"speaker":270,"description":"<p><span  >The popularity of mobile gaming and in-app purchases has changed the way games are played. Once upon a time, the only limit to how far you could progress was your skill level and persistence. Now, games seem to be designed to hinder us until we have either shelled out real currency for a lot of virtual gems, or watched a lot of advertisements. That’s not fun, that’s tedious!<\/span><\/p>\n<p>Robots are good at tasks that require precision and speed, but they are also great at tasks that are tedious and require an infinite amount of patience. What if we programmed a robot to do the crap parts of mobile games for us? Then we can enjoy the fun parts and \/ or collect all of the things as we of the Pokémon generation have been programmed to do.<\/p>\n<p>In this talk we’ll learn how to use an open source robot called Tapsterbot, a webcam, and Node.js OpenCV bindings to teach your computer to play your favorite mobile games for you (or just watch the ads) so that you can do more important things!<\/p>\n","room":"Chesapeake Room A & B","summary":"The popularity of mobile gaming and in-app purchases has changed the way games are played. Once upon a time, the only limit to how far you could progress was your skill level and persistence. Now, gam","starts":1461349800,"ends":1461352500,"starts_pretty":"2:30 pm","ends_pretty":"3:15 pm"},{"ID":297,"title":"Intro to Graph Databases","slug":"intro-to-graph-databases","featured_image":false,"featured_image_srcset":false,"speaker":272,"description":"<p><span  >Pop quiz time. Think about all the database types (such as Relational) that you know about. Now: Shout out the first one that comes to mind when you hear &#8220;NoSQL.&#8221;<\/span><\/p>\n<p>Time to grade your quiz. Did you actually shout? If so, you passed!<\/p>\n<p>Ok, ok… Joking aside: NoSQL is a blanket term for non-relational database engines, and there are several types: Document, Key\/value, Column, and Graph. And within these types, there are dozens of database engines to choose from (some even combining elements from multiple types).<\/p>\n<p>In this talk, we’ll dive into Graph databases. Graph databases, fundamentally, consist of nodes and relationships. For example, imagine an actor (node) acting (relationship) in a movie (node). Now imagine wanting to know who else acted in that movie? What about other movies that actor appeared in? What about actors who have appeared in multiple movies directed by the same person? Yes, you can do any of these queries with any database, but with graph databases, relationships are 1st-class citizens, just like nodes are, and we’ll see how easy it is to traverse!<\/p>\n<p>Using Neo4j as our demo database, we&#8217;ll see how to store and query data through Neo4j’s built-in web-based query window, as well as code-based examples.<\/p>\n","room":"Chesapeake Room C","summary":"Pop quiz time. Think about all the database types (such as Relational) that you know about. Now: Shout out the first one that comes to mind when you hear &#8220;NoSQL.&#8221; Time to grade your quiz.","starts":1461349800,"ends":1461352500,"starts_pretty":"2:30 pm","ends_pretty":"3:15 pm"},{"ID":298,"title":"Developers are Marketing Superheroes","slug":"developers-are-marketing-superheroes","featured_image":false,"featured_image_srcset":false,"speaker":274,"description":"<p><span  >Developers often treat marketing as if it were a radioactive spider. Something to be kept far away and then crushed with a heavy object. This talk will cover what happens when you miss, the spider bites you and you need to suddenly take responsibility for having great marketing superpowers. Learn how the marketing profession has changed, where developers fit in and how the skills and insights you take for granted as a developer can be used to spectacular effect in both your personal marketing and as a potential career path.<\/span><\/p>\n","room":"Virginia Room","summary":"Developers often treat marketing as if it were a radioactive spider. Something to be kept far away and then crushed with a heavy object. This talk will cover what happens when you miss, the spider bit","starts":1461349800,"ends":1461352500,"starts_pretty":"2:30 pm","ends_pretty":"3:15 pm"},{"ID":224,"title":"Building Bulletproof Mobile SDKs","slug":"the-tenets-of-mobile-sdk-design","featured_image":false,"featured_image_srcset":false,"description":"<p><span  >Mobile SDKs are a very, very dangerous beast. Especially on iOS, where a resubmission can take over 2 weeks to clear approval, having a bug in an SDK can be disastrous. Mobile SDKs have the potential to touch hundreds of millions of users and must be bullet proof.<\/span><\/p>\n<p>We will go over some lessons learned as we developed the Flurry SDK and I will present an over-arching set of principles to consider when developing a mobile SDK.<\/p>\n","speaker":222,"room":"Lynnhaven Room","summary":"Mobile SDKs are a very, very dangerous beast. Especially on iOS, where a resubmission can take over 2 weeks to clear approval, having a bug in an SDK can be disastrous. Mobile SDKs have the potential","starts":1461349800,"ends":1461352500,"starts_pretty":"2:30 pm","ends_pretty":"3:15 pm"}],"key":"1430-1515","starts_pretty":"2:30 pm","ends_pretty":"3:15 pm"},{"items":[{"ID":284,"title":"Getting Comfortable Being Uncomfortable","slug":"getting-comfortable-being-uncomfortable","featured_image":false,"featured_image_srcset":false,"speaker":245,"description":"<p><span  >There&#8217;s no denying that engineers are in high demand. Bootcamps are popping up everywhere, and while they&#8217;re churning out highly motivated juniors, often it&#8217;s seniors that companies are really after. So how do we bridge this gap together? On the surface it often looks like we&#8217;ve &#8216;naturally&#8217; developed into our current roles. And, as we progress it&#8217;s incredibly easy to forget what it was like being new. Rest assured however, for most the journey has been filled with a whole lot of grit, determination, and discipline. In this talk, we&#8217;ll discuss lessons learned one year after going from a bootcamp grad, to a full time JavaScript developer. Plan to walk away empowered, and with renewed passion for the incredible industry we&#8217;re all a part of!<\/span><\/p>\n","room":"Chesapeake Room A & B","summary":"There&#8217;s no denying that engineers are in high demand. Bootcamps are popping up everywhere, and while they&#8217;re churning out highly motivated juniors, often it&#8217;s seniors that companies","starts":1461353400,"ends":1461356100,"starts_pretty":"3:30 pm","ends_pretty":"4:15 pm"},{"ID":286,"title":"Building the real-time web in Phoenix and Elixir","slug":"building-the-real-time-web-in-phoenix-and-elixir","featured_image":false,"featured_image_srcset":false,"speaker":249,"description":"<p><span  >As technologies like websockets have entered ubiquity, the web has become increasingly real time. However, many of our tools and frameworks are ill-suited to taking advantage of this new technology. If we’re going to harness the power that sockets provide then we’re going to need tools that can rise to the occasion.<\/span><\/p>\n<p>Elixir is a new, functional language that targets the erlang virtual machine. Because of this its a language capable of massive scale. Phoenix is a brand new web framework that supports real time applications right out of the box.<\/p>\n<p>In this talk we’ll demonstrate just how easy it is to build and deploy a real-time web application in phoenix that is capable of growing to massive scale.<\/p>\n","room":"Virginia Room","summary":"As technologies like websockets have entered ubiquity, the web has become increasingly real time. However, many of our tools and frameworks are ill-suited to taking advantage of this new technology. I","starts":1461353400,"ends":1461356100,"starts_pretty":"3:30 pm","ends_pretty":"4:15 pm"},{"ID":288,"title":"How to Make Front-End Development More Functional","slug":"how-to-make-front-end-development-more-functional","featured_image":false,"featured_image_srcset":false,"speaker":254,"description":"<p><span  >Functional Programming paradigm produces more reliable and readable code, it also helps us think about the problem at hand more before deciding how to solve it. Julia will be talking about some of the concepts in functional programming, as well as introducing some of the existing languages we can use to make our front-end applications more functional. <\/span><\/p>\n","room":"Chesapeake Room C","summary":"Functional Programming paradigm produces more reliable and readable code, it also helps us think about the problem at hand more before deciding how to solve it. Julia will be talking about some of the","starts":1461353400,"ends":1461356100,"starts_pretty":"3:30 pm","ends_pretty":"4:15 pm"},{"ID":217,"title":"Ionic: JavaScript Everywhere (even mobile apps!)","slug":"ionic-javascript-everywhere-even-mobile-apps","featured_image":false,"featured_image_srcset":false,"description":"<p><span  >There are plenty of frameworks available for mobile app development, but none as production capable and stable as Ionic. In this session, we&#8217;ll go through just how Ionic makes it easy to get started and to deliver a cross-platform mobile app that includes access to all the native features of your phone, like your Camera, Bluetooth, or Contacts. Can React do that?<\/span><\/p>\n","speaker":215,"room":"Lynnhaven Room","summary":"There are plenty of frameworks available for mobile app development, but none as production capable and stable as Ionic. In this session, we&#8217;ll go through just how Ionic makes it easy to get sta","starts":1461353400,"ends":1461356100,"starts_pretty":"3:30 pm","ends_pretty":"4:15 pm"}],"key":"1530-1615","starts_pretty":"3:30 pm","ends_pretty":"4:15 pm"},{"items":[{"ID":283,"title":".NET MF - Brewing Beer with .NET","slug":"net-mf-brewing-beer-with-net","featured_image":false,"featured_image_srcset":false,"speaker":243,"description":"<p><span  >An introduction to the use of the .NET Micro Framework and it&#8217;s ability to provide automation. Code demonstration using GHI&#8217;s Gadgeteer product to maintain precise fluid temperatures and an architectural layout and design of a fully automated home brewery.<\/span><\/p>\n","room":"Chesapeake Room C","summary":"An introduction to the use of the .NET Micro Framework and it&#8217;s ability to provide automation. Code demonstration using GHI&#8217;s Gadgeteer product to maintain precise fluid temperatures and a","starts":1461357000,"ends":1461359700,"starts_pretty":"4:30 pm","ends_pretty":"5:15 pm"},{"ID":285,"title":"Docker for Noobs","slug":"docker-for-noobs","featured_image":false,"featured_image_srcset":false,"speaker":247,"description":"<p><span  >You keep hearing about Docker Containers and how it makes everything magical, but what&#8217;s the real story, and how do you get the fast track on using it for development locally? You&#8217;ll learn some of the pain points starting out, and how to &#8220;Dockerize&#8221; an existing web app.<\/span><\/p>\n","room":"Virginia Room","summary":"You keep hearing about Docker Containers and how it makes everything magical, but what&#8217;s the real story, and how do you get the fast track on using it for development locally? You&#8217;ll learn","starts":1461357000,"ends":1461359700,"starts_pretty":"4:30 pm","ends_pretty":"5:15 pm"},{"ID":295,"title":"I'm unqualified to be CEO of anything. AND SO CAN YOU!","slug":"im-unqualified-to-be-ceo-of-anything-and-so-can-you","featured_image":false,"featured_image_srcset":false,"speaker":268,"description":"<p>My goal in this talk is to convey my fundamental thesis of everything: no one has any idea what they&#8217;re doing, including you, and me. With that as our starting point, I traverse my own atypical career path and draw lessons on how to reconcile corporate bullshit with reality. After earning a degree in Computer Science from Pretty Good University, I started as an enterprise software developer at a large Wall Street firm, and a few years later ended up where I am now: unemployed, and making more money, having more fun, and gaining more knowledge than would be possible in any corporate job anywhere.<\/p>\n","room":"Lynnhaven Room","summary":"My goal in this talk is to convey my fundamental thesis of everything: no one has any idea what they&#8217;re doing, including you, and me. With that as our starting point, I traverse my own atypical","starts":1461357000,"ends":1461359700,"starts_pretty":"4:30 pm","ends_pretty":"5:15 pm"},{"ID":209,"title":"How They Work Better Together: Lean UX, Agile Development and User-Centered Design","slug":"how-they-work-better-together-lean-ux-agile-development-and-user-centered-design","featured_image":false,"featured_image_srcset":false,"description":"<p><span  >Design has often been cut off from the development side of the house, creating static images that are then handed off to developers to build. Invariably, this waterfall approach leads to unhappy designers and frustrated programmers, and often a product that misses the mark. We’ll study successes and failures from both consultancies and product companies both large and small.<\/span><\/p>\n<p>Takeaways:<br \/>\n* Integrating design into an agile development team<br \/>\n* Sketching &#8211; not just for designers<br \/>\n* What processes work well<br \/>\n* What processes lead to problems<br \/>\n* Things to take back and try on their teams<\/p>\n","speaker":207,"room":"Chesapeake Room A & B","summary":"Design has often been cut off from the development side of the house, creating static images that are then handed off to developers to build. Invariably, this waterfall approach leads to unhappy desig","starts":1461357000,"ends":1461359700,"starts_pretty":"4:30 pm","ends_pretty":"5:15 pm"}],"key":"1630-1715","starts_pretty":"4:30 pm","ends_pretty":"5:15 pm"},{"items":[{"title":"Happy Hour","location":"","starts":1463001300,"ends":1463007600,"starts_pretty":"5:15 pm","ends_pretty":"7:00 pm"}],"key":"1715-1900","starts_pretty":"5:15 pm","ends_pretty":"7:00 pm"}]}